In [1]:
import pandas as pd

In [3]:
filepath = "data files/edited carsales for cleaning.csv"
df = pd.read_csv(filepath)

In [4]:
df.tail()

   Manufacturer   Model  Year   Sales  Revenue
18       Nissan   Rogue  2023  2300.0  85000.0
19       Nissan  Murano  2021  1800.0      NaN
20    Chevrolet   Tahoe  2022  2200.0  80000.0
21       Nissan   Rogue  2023  2300.0  85000.0
22       Nissan  Murano  2021  1800.0  65000.0

In [6]:
df.isnull().sum()

Manufacturer    1
Model           0
Year            0
Sales           1
Revenue         2
dtype: int64

In [7]:
df[df.isnull().any(axis=1)]

   Manufacturer    Model  Year   Sales  Revenue
4          Ford  Mustang  2023  2200.0      NaN
7           NaN   Malibu  2021  1400.0  50000.0
9        Nissan   Sentra  2023     NaN  85000.0
19       Nissan   Murano  2021  1800.0      NaN

In [9]:
df.fillna(value={'Manufacturer':'Unknown'},inplace=True)

In [10]:
df.head(10)

  Manufacturer      Model  Year   Sales  Revenue
0       Toyota    Corolla  2021  1500.0  50000.0
1       Toyota      Camry  2022  2000.0  70000.0
2        Honda      Civic  2022  1800.0  60000.0
3        Honda     Accord  2021  1700.0  65000.0
4         Ford    Mustang  2023  2200.0      NaN
5         Ford     Fusion  2021  1600.0  55000.0
6    Chevrolet  Silverado  2022  1900.0  75000.0
7      Unknown     Malibu  2021  1400.0  50000.0
8       Nissan     Altima  2022  2100.0  70000.0
9       Nissan     Sentra  2023     NaN  85000.0

In [12]:
average = df['Sales'].mean()
df.fillna(value={'Sales':average},inplace=True)

# df.head(10)

In [14]:
df.dropna(inplace=True)

In [15]:
df.head(10)

   Manufacturer      Model  Year   Sales  Revenue
0        Toyota    Corolla  2021  1500.0  50000.0
1        Toyota      Camry  2022  2000.0  70000.0
2         Honda      Civic  2022  1800.0  60000.0
3         Honda     Accord  2021  1700.0  65000.0
5          Ford     Fusion  2021  1600.0  55000.0
6     Chevrolet  Silverado  2022  1900.0  75000.0
7       Unknown     Malibu  2021  1400.0  50000.0
8        Nissan     Altima  2022  2100.0  70000.0
9        Nissan     Sentra  2023  1900.0  85000.0
10       Toyota      Prius  2021  1600.0  60000.0

In [16]:
df.drop_duplicates(inplace=True)

In [17]:
df.tail()

   Manufacturer    Model  Year   Sales  Revenue
15         Ford   Escape  2023  2100.0  75000.0
16    Chevrolet  Equinox  2021  1700.0  60000.0
17    Chevrolet    Tahoe  2022  2200.0  80000.0
18       Nissan    Rogue  2023  2300.0  85000.0
22       Nissan   Murano  2021  1800.0  65000.0

In [18]:
df.duplicated().sum()

0

In [19]:
df.dtypes

Manufacturer     object
Model            object
Year              int64
Sales           float64
Revenue         float64
dtype: object

In [20]:
new_df = pd.DataFrame({"name":["Alice","Bob","Alice"],"age":[25,30,25]})

In [21]:
new_df

    name  age
0  Alice   25
1    Bob   30
2  Alice   25

In [23]:
new_df['age'] = new_df['age'].astype(float)
new_df

    name   age
0  Alice  25.0
1    Bob  30.0
2  Alice  25.0

In [24]:
df.head()

  Manufacturer    Model  Year   Sales  Revenue
0       Toyota  Corolla  2021  1500.0  50000.0
1       Toyota    Camry  2022  2000.0  70000.0
2        Honda    Civic  2022  1800.0  60000.0
3        Honda   Accord  2021  1700.0  65000.0
5         Ford   Fusion  2021  1600.0  55000.0

In [28]:
q1 = df["Sales"].quantile(0.25)
q3 = df["Sales"].quantile(0.75)
iqr = q3-q1
print(q1, q3, iqr)

1650.0 2050.0 400.0

In [29]:
lower_bond=q1-1.5*iqr

In [30]:
upper_bond=q3+1.5*iqr

In [31]:
upper_bond

2650.0

In [35]:
required = df[(df["Sales"] >= lower_bond) & (df["Sales"] <= upper_bond)]
print("All Sales\n",df["Sales"].values)
print("Sales after removing outliers\n",required["Sales"].values)

All Sales
 [1500. 2000. 1800. 1700. 1600. 1900. 1400. 2100. 1900. 1600. 1900. 2200.
 1500. 2000. 2100. 1700. 2200. 2300. 1800.]
Sales after removing outliers
 [1500. 2000. 1800. 1700. 1600. 1900. 1400. 2100. 1900. 1600. 1900. 2200.
 1500. 2000. 2100. 1700. 2200. 2300. 1800.]

In [ ]:
df.to_csv(DataFiles/